In [1]:
import seaborn as sns

In [2]:
import pandas as pd

In [3]:
df = sns.load_dataset('titanic')
df

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0           0       3    male  22.0  ...   NaN  Southampton     no  False
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
2           1       3  female  26.0  ...   NaN  Southampton    yes   True
3           1       1  female  35.0  ...     C  Southampton    yes  False
4           0       3    male  35.0  ...   NaN  Southampton     no   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[891 rows x 15 columns]

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

'pclass','sex','sibsp','parch','embarked','class','who','adult_male','embark_town','alive','alone'

## 변수 선택

In [5]:
df[['fare','sex','pclass']]

        fare     sex  pclass
0     7.2500    male       3
1    71.2833  female       1
2     7.9250  female       3
3    53.1000  female       1
4     8.0500    male       3
..       ...     ...     ...
886  13.0000    male       2
887  30.0000  female       1
888  23.4500  female       3
889  30.0000    male       1
890   7.7500    male       3

[891 rows x 3 columns]

In [9]:
X = df[['fare','pclass']]
Y = df[['survived']]
X.shape, Y.shape

((891, 2), (891, 1))

## 모델 적용

In [7]:
from sklearn.preprocessing import StandardScaler

In [10]:
scaler = StandardScaler()
scaler.fit(X)

StandardScaler(copy=True, with_mean=True, with_std=True)

In [11]:
X = scaler.transform(X)
X

array([[-0.50244517,  0.82737724],
       [ 0.78684529, -1.56610693],
       [-0.48885426,  0.82737724],
       ...,
       [-0.17626324,  0.82737724],
       [-0.04438104, -1.56610693],
       [-0.49237783,  0.82737724]])

In [12]:
from sklearn.model_selection import train_test_split

In [13]:
x_train, x_test, y_train, y_test = train_test_split(X, Y)
x_train.shape, x_test.shape, y_train.shape, y_test.shape

((668, 2), (223, 2), (668, 1), (223, 1))

In [14]:
from sklearn.linear_model import LogisticRegression

In [15]:
logR = LogisticRegression()

In [16]:
logR.fit(x_train, y_train)

/usr/local/lib/python3.7/dist-packages/sklearn/utils/validation.py:760: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [17]:
logR.score(x_train, y_train)

0.6841317365269461

In [18]:
logR.score(x_test, y_test)

0.6636771300448431